Autodesk.Revit.DB.TransmittedModelOptions
Enum giving desired behavior when opening or saving a transmitted
workshared model.
Since:
2013
Since:
2013

Autodesk.Revit.DB.TransmittedModelOptions.CancelOperation
Cancel the save or load operation.

Autodesk.Revit.DB.TransmittedModelOptions.KeepAsTransmitted
The model will remain marked as transmitted; users will not be able to
create locals until it is saved as a new central.

Autodesk.Revit.DB.TransmittedModelOptions.SaveAsNewCentral
The model should be saved as a new central. (On open, it will be
saved as a new central in its current location. On save, it will be
saved as central but the user can choose a location.)